In [1]:
import pandas as pd
import numpy as np

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [3]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [4]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [7]:
date['date'] = pd.to_datetime(date['date'])

In [8]:
time['date'] = pd.to_datetime(time['date'])

## 1. Extract year

In [9]:
date['year'] = date['date'].dt.year
date.head()

        date  product_id  city_id  orders  year
0 2019-12-10        5628       25       3  2019
1 2018-08-15        3646       14     157  2018
2 2018-10-23        1859       25       1  2018
3 2019-08-17        7292       25       1  2019
4 2019-01-06        4344       25       3  2019

## 2. Extract Month

In [10]:
date['month'] = date['date'].dt.month

In [11]:
date.head()

        date  product_id  city_id  orders  year  month
0 2019-12-10        5628       25       3  2019     12
1 2018-08-15        3646       14     157  2018      8
2 2018-10-23        1859       25       1  2018     10
3 2019-08-17        7292       25       1  2019      8
4 2019-01-06        4344       25       3  2019      1

In [12]:
# month name:
date['month_name'] = date['date'].dt.month_name()

In [13]:
date.head()

        date  product_id  city_id  orders  year  month month_name
0 2019-12-10        5628       25       3  2019     12   December
1 2018-08-15        3646       14     157  2018      8     August
2 2018-10-23        1859       25       1  2018     10    October
3 2019-08-17        7292       25       1  2019      8     August
4 2019-01-06        4344       25       3  2019      1    January

## 3. Extract day

In [14]:
date['day'] = date['date'].dt.day
date.head()

        date  product_id  city_id  orders  year  month month_name  day
0 2019-12-10        5628       25       3  2019     12   December   10
1 2018-08-15        3646       14     157  2018      8     August   15
2 2018-10-23        1859       25       1  2018     10    October   23
3 2019-08-17        7292       25       1  2019      8     August   17
4 2019-01-06        4344       25       3  2019      1    January    6

In [15]:
# day of week :
date['week'] = date['date'].dt.dayofweek
date.head()

        date  product_id  city_id  orders  year  month month_name  day  week
0 2019-12-10        5628       25       3  2019     12   December   10     1
1 2018-08-15        3646       14     157  2018      8     August   15     2
2 2018-10-23        1859       25       1  2018     10    October   23     1
3 2019-08-17        7292       25       1  2019      8     August   17     5
4 2019-01-06        4344       25       3  2019      1    January    6     6

In [16]:
# name of day
date['date_name'] = date['date'].dt.day_name()
date.head()

,date,product_id,city_id,orders,year,month,month_name,day,week,date_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [17]:
date.drop(columns=['product_id','city_id','orders']).head()

        date  year  month month_name  day  week  date_name
0 2019-12-10  2019     12   December   10     1    Tuesday
1 2018-08-15  2018      8     August   15     2  Wednesday
2 2018-10-23  2018     10    October   23     1    Tuesday
3 2019-08-17  2019      8     August   17     5   Saturday
4 2019-01-06  2019      1    January    6     6     Sunday

In [18]:
# is weekend?
date['weekend'] = np.where(date['date_name'].isin(['Sunday','Saturday']),1,0)
date.drop(columns=['product_id','city_id','orders']).head()

        date  year  month month_name  day  week  date_name  weekend
0 2019-12-10  2019     12   December   10     1    Tuesday        0
1 2018-08-15  2018      8     August   15     2  Wednesday        0
2 2018-10-23  2018     10    October   23     1    Tuesday        0
3 2019-08-17  2019      8     August   17     5   Saturday        1
4 2019-01-06  2019      1    January    6     6     Sunday        1

## Extract week of the year

In [19]:
date['week_of_year'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,week,date_name,weekend,week_of_year
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [20]:
# extract quarter
date['quarter'] = date['date'].dt.quarter
date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,week,date_name,weekend,week_of_year,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

### Extract Semester

In [21]:
date['semester'] = np.where(date['quarter'].isin([1,2]),1,2)
date.drop(columns=['product_id','city_id','orders']).head()

,date,year,month,month_name,day,week,date_name,weekend,week_of_year,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

### Extract time elapsed between dates

In [22]:
import datetime
today = datetime.datetime.today()
today

datetime.datetime(2026, 1, 18, 11, 20, 4, 391161)

In [23]:
today - date['date']

0     2231 days 11:20:04.391161
1     2713 days 11:20:04.391161
2     2644 days 11:20:04.391161
3     2346 days 11:20:04.391161
4     2569 days 11:20:04.391161
                 ...
995   2659 days 11:20:04.391161
996   2600 days 11:20:04.391161
997   2448 days 11:20:04.391161
998   2513 days 11:20:04.391161
999   2287 days 11:20:04.391161
Name: date, Length: 1000, dtype: timedelta64[ns]

In [24]:
(today - date['date']).dt.days

0      2231
1      2713
2      2644
3      2346
4      2569
       ...
995    2659
996    2600
997    2448
998    2513
999    2287
Name: date, Length: 1000, dtype: int64

In [25]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [26]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [27]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [28]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [29]:
# Extract time part
time['time'] = time['date'].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [30]:
# Time difference
today - time['date']

0     4417 days 10:30:04.391161
1     4281 days 11:40:04.391161
2     4767 days 10:59:04.391161
3     4069 days 10:49:04.391161
4     4466 days 12:09:04.391161
                 ...
995   5056 days 10:30:04.391161
996   4377 days 12:06:04.391161
997   4842 days 11:43:04.391161
998   4958 days 11:46:04.391161
999   4230 days 11:55:04.391161
Name: date, Length: 1000, dtype: timedelta64[ns]

In [31]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.816666e+08
1      3.699204e+08
2      4.119083e+08
3      3.516005e+08
4      3.859061e+08
           ...
995    4.368762e+08
996    3.782164e+08
997    4.183910e+08
998    4.284136e+08
999    3.655149e+08
Name: date, Length: 1000, dtype: float64

In [32]:
# in minutes
(today - time['date'])/np.timedelta64(1,'m')

0      6.361110e+06
1      6.165340e+06
2      6.865139e+06
3      5.860009e+06
4      6.431769e+06
           ...
995    7.281270e+06
996    6.303606e+06
997    6.973183e+06
998    7.140226e+06
999    6.091915e+06
Name: date, Length: 1000, dtype: float64

In [33]:
# in hours
(today - time['date'])/np.timedelta64(1,'h')

0      106018.501220
1      102755.667886
2      114418.984553
3       97666.817886
4      107196.151220
           ...
995    121354.501220
996    105060.101220
997    116219.717886
998    119003.767886
999    101531.917886
Name: date, Length: 1000, dtype: float64